import type { SimpleIcon } from 'simple-icons';
import { siFacebook, siX, siInstagram, siYoutube } from 'simple-icons';

export type MenuItem = {
  name: string;
  href: string;
};

export type SocialItem = {
  name: string;
  href: string;
  icon: SimpleIcon;
};

export const menuItems: MenuItem[] = [
  { name: 'Програм', href: '/program' },
  { name: 'Вести', href: '/news' },
  { name: 'Тим', href: '/team' },
];

export const socialItems: SocialItem[] = [
  {
    name: 'Youtube',
    icon: siYoutube,
    href: 'https://www.youtube.com/@alternativacentar',
  },
  {
    name: 'Instagram',
    icon: siInstagram,
    href: 'https://www.instagram.com/alternativacentar?igsh=MTFsdnZwejE5aWVmMA%3D%3D',
  },
  {
    name: 'Facebook',
    icon: siFacebook,
    href: 'https://www.facebook.com/alternativacentar?mibextid=ZbWKwL',
  },
  {
    name: 'X',
    icon: siX,
    href: 'https://x.com/alt_centar?t=VXmr8B1fE3Hu37JZX3AZ-w&s=09',
  },
];

export const neighborhoods: {
  value: string;
  title: string;
  responsiblePerson: string;
  phone: string;
}[] = [
    {
      value: 'banovoBrdo',
      title: 'Баново Брдо',
      responsiblePerson: 'Михаило Цекић',
      phone: '+381 64 1136471',
    },
    {
      value: 'velikaMostanica',
      title: 'Велика Моштаница',
      responsiblePerson: 'Борис Поседи',
      phone: '+381 61 6092016',
    },
    {
      value: 'zarkovo',
      title: 'Жарково',
      responsiblePerson: 'Урош Келечевић',
      phone: '+381 69 2506455',
    },
    {
      value: 'zeleznik',
      title: 'Железник',
      responsiblePerson: 'Борис Поседи',
      phone: '+381 61 6092016',
    },
    {
      value: 'ostruznica',
      title: 'Остружница',
      responsiblePerson: 'Борис Поседи',
      phone: '+381 61 6092016',
    },
    {
      value: 'rusanj',
      title: 'Рушањ',
      responsiblePerson: 'Борис Поседи',
      phone: '+381 61 6092016',
    },
    {
      value: 'sremcica',
      title: 'Сремчица',
      responsiblePerson: 'Борис Поседи',
      phone: '+381 61 6092016',
    },
    {
      value: 'umka',
      title: 'Умка',
      responsiblePerson: 'Борис Поседи',
      phone: '+381 61 6092016',
    },
    {
      value: 'cerak',
      title: 'Церак',
      responsiblePerson: 'Борис Поседи',
      phone: '+381 61 6092016',
    },
    {
      value: 'cukarickaPadina',
      title: 'Чукаричка Падина',
      responsiblePerson: 'Борис Поседи',
      phone: '+381 61 6092016',
    },
  ];

export type TeamMember = {
  name: string;
  image?: string;
  position: string;
  biography: string;
};

export const teamMembers: TeamMember[] = [
  {
    name: 'Пеђа Милосављевић',
    position: 'Председник покрета',
    image: '/team/pm.jpg',
    biography: `Пеђа Милосављевић (Београд, 20. април 1974. г.) је председник локалног покрета Алтернатива за Чукарицу, адвокат и дипломирани правник правног факултета.

Основне студије на Правном факултету у Београду завршио је 2001, док је правосудни испит положио 2004. године. Две године касније оснива адвокатску канцеларију са седиштем у Београду, а бави се примарно имовинским и компанијским правом. Аутор је књиге „Анатомија елитистичке демократије“, као и многобројних текстова из правне праксе, политичке и правне филозофије. Редовно пише своје колумне за интернет портал Нација, а 2024. године учествује у оснивању покрета Алтернатива за Чукарицу.

Поред адвокатуре и писања текстова у слободно време доста чита и бави се разним индивидуалним спортовима као што су тенис и пливање. Ожењен је и има троје деце.
`,
  },
  {
    name: 'Филип Калмаревић',
    position: 'Генерални секретар',
    image: '/team/fk.jpg',
    biography: `Филип Калмаревић (Београд, 27. новембар 2003. г.) је генерални секретар локалног покрета Алтернатива за Чукарицу, уредник портала и студент међународних односа.

Основне студије на Факултету политичких наука уписао је 2022. године. Новинарску каријеру започео је на Слободној телевизији након чега је покренуо сопствени портал. Прве кораке ка политичком ангажовању направио је као члан Напредног клуба где је радио на изради Извештаја о политичким правима српског народа, након чега се директно ангажује у политици као члан Двери. Због неслагања са политиком напушта чланство и 2024. године учествује у оснивању покрета Алтернатива за Чукарицу.

Поред студирања и новинарства у слободно време се бави дигиталним маркетингом и индивидуалним спортовима. Завршио је Правно-пословну средњу школу у Београду.
`,
  },
  {
    name: 'Борис Поседи',
    position: 'Извршни одбор',
    image: '/team/bp.jpg',
    biography: `Борис Поседи (Београд, 24. октобар 2002. г.) је председника извршног одбора локалног покрета Алтернатива за Чукарицу и студент међународних односа.

Основне студије на Факултету политичких наука уписао је 2022. године. Годинама је волонтирао на разним домаћим и међународним спортским такмичењима, а још као средњошколац је почео да се бави друштвеним активизмом. Учестовао је у студентским протестима (2024-2025) и био део великог студентског покрета. Аутор је многобројних текстова о домаћој и међународној политици објављених на интернет порталу Нација, а 2024. године учествује у оснивању покрета Алтернатива за Чукарицу.

Поред студирања и писања текстова у слободно време доста чита и бави се разним спортовима као што су фудбал и кошарка. Завршио је Тринаесту београдску гимназију.`,
  },
  {
    name: 'Тања Бакић',
    position: 'Маркетинг тим',
    image: '/team/tb.jpg',
    biography: `Тања Бакић (Београд, 05. децембар 2003. г.) је шеф тима за дигитални маркетинг локалног покрета Алтернатива за Чукарицу и студент међународних односа.

Основне студије на Факултету политичких наука уписала је 2022. године. Учествовала је на XVII регионалном семинару студената Факултета политичких наука на Златибору. Годинама се бави волонтерским и хуманитарним радом, а још у средњој школи је почела да се бави друштвеним активизмом, примарно тако што је учествовала на протестима. На локалним београдским изборима била је задужена за праћење излазности, а 2024. године учествује у оснивању покрета Алтернатива за Чукарицу.

Поред студирања и дигиталног маркетинга у слободно време доста чита о геополитици и међународним односима. Завршила је Правно-пословну средњу школу у Београду.`,
  },
];
