import type { SimpleIcon } from 'simple-icons';
import { siFacebook, siX, siInstagram, siYoutube } from 'simple-icons';

export type MenuItem = {
  name: string;
  href: string;
};

export type SocialItem = {
  name: string;
  href: string;
  icon: SimpleIcon;
};

export const menuItems: MenuItem[] = [
  { name: 'Програм', href: '/program' },
  { name: 'Вести', href: '/news' },
  { name: 'Тим', href: '/team' },
];

export const socialItems: SocialItem[] = [
  {
    name: 'Youtube',
    icon: siYoutube,
    href: 'https://www.youtube.com/@alternativacentar',
  },
  {
    name: 'Instagram',
    icon: siInstagram,
    href: 'https://www.instagram.com/alternativacentar?igsh=MTFsdnZwejE5aWVmMA%3D%3D',
  },
  {
    name: 'Facebook',
    icon: siFacebook,
    href: 'https://www.facebook.com/alternativacentar?mibextid=ZbWKwL',
  },
  {
    name: 'X',
    icon: siX,
    href: 'https://x.com/alt_centar?t=VXmr8B1fE3Hu37JZX3AZ-w&s=09',
  },
];

export const neighborhoods: {
  value: string;
  title: string;
  responsiblePerson: string;
  phone: string;
}[] = [
    {
      value: 'banovoBrdo',
      title: 'Баново Брдо',
      responsiblePerson: 'Михаило Цекић',
      phone: '+381 64 1136471',
    },
    {
      value: 'velikaMostanica',
      title: 'Велика Моштаница',
      responsiblePerson: 'Борис Поседи',
      phone: '+381 61 6092016',
    },
    {
      value: 'zarkovo',
      title: 'Жарково',
      responsiblePerson: 'Урош Келечевић',
      phone: '+381 69 2506455',
    },
    {
      value: 'zeleznik',
      title: 'Железник',
      responsiblePerson: 'Борис Поседи',
      phone: '+381 61 6092016',
    },
    {
      value: 'ostruznica',
      title: 'Остружница',
      responsiblePerson: 'Борис Поседи',
      phone: '+381 61 6092016',
    },
    {
      value: 'rusanj',
      title: 'Рушањ',
      responsiblePerson: 'Борис Поседи',
      phone: '+381 61 6092016',
    },
    {
      value: 'sremcica',
      title: 'Сремчица',
      responsiblePerson: 'Борис Поседи',
      phone: '+381 61 6092016',
    },
    {
      value: 'umka',
      title: 'Умка',
      responsiblePerson: 'Борис Поседи',
      phone: '+381 61 6092016',
    },
    {
      value: 'cerak',
      title: 'Церак',
      responsiblePerson: 'Борис Поседи',
      phone: '+381 61 6092016',
    },
    {
      value: 'cukarickaPadina',
      title: 'Чукаричка Падина',
      responsiblePerson: 'Борис Поседи',
      phone: '+381 61 6092016',
    },
  ];

export type TeamMember = {
  name: string;
  image?: string;
  position: string;
  biography: string;
};

export const teamMembers: TeamMember[] = [
  {
    name: 'Пеђа Милосављевић',
    position: 'Председник покрета',
    image: '/team/pm.jpg',
    biography: `Филип Калмаревић (Београд, 27. новембар 2003. г.) је генерални секретар локалног покрета Алтернатива за Чукарицу, уредник портала и студент међународних односа.

Професионалну новинарску каријеру започео је у редакцији Слободне телевизије након чега је покренуо своју ауторску емисију „Нација” на YouTube каналу Нација ТВ. Прве кораке ка политичком ангажовању направио је као члан Напредног клуба др Чедомира Антића где је радио на изради Извештаја о политичким правима српског народа у региону, након чега се директно ангажује у политици у оквиру Српског покрета Двери. Због неслагања са одлукама и званичном политиком странке, напушта чланство ове партије и оснива покрет на својој општини „Алтернатива за Чукарицу“.

Поред новинарства у слободно време се бави дигиталним маркетингом, продукцијом и индивидуалним спортовима. Завршио је Правно-пословну средњу школу у Београду.`,
  },
  {
    name: 'Филип Калмаревић',
    position: 'Генерални секретар',
    image: '/team/fk.jpg',
    biography: `Филип Калмаревић (Београд, 27. новембар 2003. г.) је генерални секретар локалног покрета Алтернатива за Чукарицу, уредник портала и студент међународних односа.

Професионалну новинарску каријеру започео је у редакцији Слободне телевизије након чега је покренуо своју ауторску емисију „Нација” на YouTube каналу Нација ТВ. Прве кораке ка политичком ангажовању направио је као члан Напредног клуба др Чедомира Антића где је радио на изради Извештаја о политичким правима српског народа у региону, након чега се директно ангажује у политици у оквиру Српског покрета Двери. Због неслагања са одлукама и званичном политиком странке, напушта чланство ове партије и оснива покрет на својој општини „Алтернатива за Чукарицу“.

Поред новинарства у слободно време се бави дигиталним маркетингом, продукцијом и индивидуалним спортовима. Завршио је Правно-пословну средњу школу у Београду.`,
  },
  {
    name: 'Борис Поседи',
    position: 'Извршни одбор',
    image: '/team/bp.jpg',
    biography: `Филип Калмаревић (Београд, 27. новембар 2003. г.) је генерални секретар локалног покрета Алтернатива за Чукарицу, уредник портала и студент међународних односа.

Професионалну новинарску каријеру започео је у редакцији Слободне телевизије након чега је покренуо своју ауторску емисију „Нација” на YouTube каналу Нација ТВ. Прве кораке ка политичком ангажовању направио је као члан Напредног клуба др Чедомира Антића где је радио на изради Извештаја о политичким правима српског народа у региону, након чега се директно ангажује у политици у оквиру Српског покрета Двери. Због неслагања са одлукама и званичном политиком странке, напушта чланство ове партије и оснива покрет на својој општини „Алтернатива за Чукарицу“.

Поред новинарства у слободно време се бави дигиталним маркетингом, продукцијом и индивидуалним спортовима. Завршио је Правно-пословну средњу школу у Београду.`,
  },
  {
    name: 'Тања Бакић',
    position: 'Маркетинг тим',
    image: '/team/tb.jpg',
    biography: `Филип Калмаревић (Београд, 27. новембар 2003. г.) је генерални секретар локалног покрета Алтернатива за Чукарицу, уредник портала и студент међународних односа.

Професионалну новинарску каријеру започео је у редакцији Слободне телевизије након чега је покренуо своју ауторску емисију „Нација” на YouTube каналу Нација ТВ. Прве кораке ка политичком ангажовању направио је као члан Напредног клуба др Чедомира Антића где је радио на изради Извештаја о политичким правима српског народа у региону, након чега се директно ангажује у политици у оквиру Српског покрета Двери. Због неслагања са одлукама и званичном политиком странке, напушта чланство ове партије и оснива покрет на својој општини „Алтернатива за Чукарицу“.

Поред новинарства у слободно време се бави дигиталним маркетингом, продукцијом и индивидуалним спортовима. Завршио је Правно-пословну средњу школу у Београду.`,
  },
];
